Revit 2027 API
BuiltInFailures.SketchFailures.NotOneCurveError Property
 More than one curve not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotOneCurveError { get; }
Public Shared ReadOnly Property NotOneCurveError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotOneCurveError {
	FailureDefinitionId^ get ();
}
static member NotOneCurveError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace